Ex3/heated-cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel Newtonian;

//nu              [0 2 -1 0 0 0 0] 0.0001;
nu              0.0001;

// Prendel @20°C
Pr		6.1;

// turbulent Prendel
Prt		0.38;

// thermal expansion coefficient
beta	2.06e-4;

// Reference temp 20°C
TRef	293.15;


// ************************************************************************* //
